[
    {
        "Id": "CPSC 203",
        "Title": "Introduction to Problem Solving using Application Software",
        "Description": "This course is an introduction to problem-solving techniques using popular application software suites. Students will learn to analyze problems and apply appropriate tools and techniques to solve them. The course will cover topics such as word processing, spreadsheets, databases, and presentation software.",
        "Instructor": "John Smith",
        "Levels": 2,
        "Credits": 3,
        "Category": "Computer Science",
        "Semester": "Fall 2023",
        "Faculty": "Science"
    },
    {
        "Id": "CPSC 203",
        "Title": "Introduction to Problem Solving using Application Software",
        "Description": "This course is an introduction to problem-solving techniques using popular application software suites. Students will learn to analyze problems and apply appropriate tools and techniques to solve them. The course will cover topics such as word processing, spreadsheets, databases, and presentation software.",
        "Instructor": "John Smith",
        "Levels": 2,
        "Credits": 3,
        "Category": "Computer Science",
        "Semester": "Fall 2023",
        "Faculty": "Science"
    },
    {
        "Id": "CPSC 217",
        "Title": "Introduction to Computer Science for Multidisciplinary Studies I",
        "Description": "This course provides an introduction to the fundamentals of computer science and programming. Students will learn basic programming concepts and techniques, such as control structures, data types, and functions. They will also gain experience with a modern programming language, such as Python or Java.",
        "Instructor": "Jane Doe",
        "Levels": 2,
        "Credits": 3,
        "Category": "Computer Science",
        "Semester": "Fall 2023",
        "Faculty": "Science"
    },
    {
        "Id": "CPSC 219",
        "Title": "Introduction to Computer Science for Multidisciplinary Studies II",
        "Description": "This course is a continuation of CPSC 217, providing a deeper exploration of programming concepts and techniques. Students will learn about data structures, algorithms, and object-oriented programming. They will also gain experience with software development tools, such as version control and integrated development environments.",
        "Instructor": "Bob Johnson",
        "Levels": 2,
        "Credits": 3,
        "Category": "Computer Science",
        "Semester": "Fall 2023",
        "Faculty": "Science"
    },
    {
        "Id": "CPSC 231",
        "Title": "Introduction to Computer Science for Computer Science Majors I",
        "Description": "This course is an introduction to computer science and programming for students majoring in computer science. Students will learn basic programming concepts and techniques, such as control structures, data types, and functions. They will also gain experience with a modern programming language, such as Python or Java.",
        "Instructor": "Sara Lee",
        "Levels": 2,
        "Credits": 3,
        "Category": "Computer Science",
        "Semester": "Fall 2023",
        "Faculty": "Science"
    },
    {
        "Id": "CPSC 251",
        "Title": "Theoretical Foundations of Computer Science I",
        "Description": "This course provides an introduction to the theoretical foundations of computer science. Students will learn about formal languages, automata theory, and computability. They will also gain experience with proof techniques and mathematical reasoning.",
        "Instructor": "Jack Smith",
        "Levels": 2,
        "Credits": 3,
        "Category": "Computer Science",
        "Semester": "Fall 2023",
        "Faculty": "Science"
    },
    {
        "Id": "CPSC 329",
        "Title": "Explorations in Information Security and Privacy",
        "Description": "This course is an introduction to information security and privacy. Students will learn about common threats and vulnerabilities, as well as techniques for securing data and systems. They will also gain experience with tools and technologies used in the field.",
        "Instructor": "Emily White",
        "Levels": 3,
        "Credits": 3,
        "Category": "Computer Science",
        "Semester": "Fall 2023",
        "Faculty": "Science"
    },
    {
        "Id": "CPSC 331",
        "Title": "Data Structures, Algorithms, and Their Analysis",
        "Description": "This course covers the fundamental data structures and algorithms used in computer science. Students will learn about sorting and searching algorithms, graph algorithms, and data structures like linked lists, trees, and heaps.",
        "Instructor": "Mark Johnson",
        "Levels": 3,
        "Credits": 3,
        "Category": "Computer Science",
        "Semester": "Fall 2023",
        "Faculty": "Science"
    },
    {
        "Id": "CPSC 351",
        "Title": "Theoretical Foundations of Computer Science II",
        "Description": "This course is a continuation of CPSC 251 and covers advanced topics in theoretical computer science. Students will learn about computability, formal languages, and complexity theory.",
        "Instructor": "Michelle Lee",
        "Levels": 3,
        "Credits": 3,
        "Category": "Computer Science",
        "Semester": "Fall 2023",
        "Faculty": "Science"
    },
    {
        "Id": "CPSC 355",
        "Title": "Computing Machinery I",
        "Description": "This course covers the fundamentals of computer architecture and organization. Students will learn about digital logic, memory systems, and instruction set architectures.",
        "Instructor": "David Brown",
        "Levels": 3,
        "Credits": 3,
        "Category": "Computer Science",
        "Semester": "Fall 2023",
        "Faculty": "Science"
    },
    {
        "Id": "CPSC 359",
        "Title": "Computing Machinery II",
        "Description": "This course is a continuation of CPSC 355 and covers advanced topics in computer architecture and organization. Students will learn about pipelining, memory hierarchies, and parallel processing.",
        "Instructor": "Sarah Kim",
        "Levels": 3,
        "Credits": 3,
        "Category": "Computer Science",
        "Semester": "Fall 2023",
        "Faculty": "Science"
    },
    {
        "Id": "CPSC 413",
        "Title": "Design and Analysis of Algorithms I",
        "Description": "This course covers advanced algorithms and data structures used in computer science. Students will learn about dynamic programming, greedy algorithms, and network flows.",
        "Instructor": "Robert Chen",
        "Levels": 4,
        "Credits": 3,
        "Category": "Computer Science",
        "Semester": "Fall 2023",
        "Faculty": "Science"
    },
    {
        "Id": "CPSC 433",
        "Title": "Artificial Intelligence",
        "Description": "This course covers the fundamental concepts of artificial intelligence. Students will learn about search algorithms, logic and reasoning, and machine learning.",
        "Instructor": "Jennifer Lee",
        "Levels": 4,
        "Credits": 3,
        "Category": "Computer Science",
        "Semester": "Fall 2023",
        "Faculty": "Science"
    },
    {
        "Id": "CPSC 441",
        "Title": "Computer Networks",
        "Description": "This course covers the fundamental concepts of computer networks. Students will learn about network architectures, protocols, and security.",
        "Instructor": "Michael Lee",
        "Levels": 4,
        "Credits": 3,
        "Category": "Computer Science",
        "Semester": "Fall 2023",
        "Faculty": "Science"
    },
    {
        "Id": "CPSC 449",
        "Title": "Programming Paradigms",
        "Description": "This course covers advanced programming concepts and paradigms. Students will learn about functional programming, object-oriented programming, and concurrent programming.",
        "Instructor": "David Kim",
        "Levels": 4,
        "Credits": 3,
        "Category": "Computer Science",
        "Semester": "Fall 2023",
        "Faculty": "Science"
    },
    {
        "Id": "CPSC 453",
        "Title": "Introduction to Computer Graphics",
        "Description": "This course provides an introduction to computer graphics. Students will learn the fundamentals of 2D and 3D graphics, including modeling, rendering, and animation techniques. Topics covered include geometric transformations, shading, texture mapping, and ray tracing.",
        "Instructor": "David Lee",
        "Levels": 4,
        "Credits": 3,
        "Category": "Computer Science",
        "Semester": "Fall 2023",
        "Faculty": "Science"
    },
    {
        "Id": "CPSC 457",
        "Title": "Principles of Operating Systems",
        "Description": "This course provides an introduction to the principles of operating systems. Students will learn about the architecture of operating systems, including processes, memory management, and file systems. Topics covered include concurrency, synchronization, and deadlock.",
        "Instructor": "Amy Chen",
        "Levels": 4,
        "Credits": 3,
        "Category": "Computer Science",
        "Semester": "Fall 2023",
        "Faculty": "Science"
    },
    {
        "Id": "CPSC 471",
        "Title": "Data Base Management Systems",
        "Description": "This course provides an introduction to database management systems. Students will learn about the design and implementation of databases, as well as techniques for querying and manipulating data. Topics covered include relational algebra, SQL, and transaction processing.",
        "Instructor": "Peter Kim",
        "Levels": 4,
        "Credits": 3,
        "Category": "Computer Science",
        "Semester": "Fall 2023",
        "Faculty": "Science"
    },
    {
        "Id": "CPSC 481",
        "Title": "Human-Computer Interaction I",
        "Description": "This course provides an introduction to human-computer interaction. Students will learn about the design and evaluation of user interfaces, including usability testing and heuristic evaluation. Topics covered include design principles, interface styles, and interaction paradigms.",
        "Instructor": "Karen Lee",
        "Levels": 4,
        "Credits": 3,
        "Category": "Computer Science",
        "Semester": "Fall 2023",
        "Faculty": "Science"
    },
    {
        "Id": "CPSC 501",
        "Title": "Advanced Programming Techniques",
        "Description": "This course provides an introduction to advanced programming techniques. Students will learn about software engineering principles, as well as tools and techniques for building large-scale software systems. Topics covered include object-oriented programming, design patterns, and software testing.",
        "Instructor": "Michael Lee",
        "Levels": 5,
        "Credits": 3,
        "Category": "Computer Science",
        "Semester": "Fall 2023",
        "Faculty": "Science"
    },
    {
        "Id": "CPSC 502.01A",
        "Title": "Research Project in Computer Science",
        "Description": "This course is designed to provide students with the opportunity to engage in research in the field of computer science. Students will work on projects that apply and extend the knowledge they have acquired in their coursework, and will be exposed to various research methodologies.",
        "Instructor": "David Lee",
        "Levels": 5,
        "Credits": 3,
        "Category": "Computer Science",
        "Semester": "Fall 2023",
        "Faculty": "Science"
    },
    {
        "Id": "CPSC 502.02A",
        "Title": "Research Project in Theoretical Computer Science",
        "Description": "This course is designed to provide students with the opportunity to engage in research in the field of theoretical computer science. Students will work on projects that explore the limits of computation and study the theoretical foundations of computer science.",
        "Instructor": "Karen Brown",
        "Levels": 5,
        "Credits": 3,
        "Category": "Computer Science",
        "Semester": "Fall 2023",
        "Faculty": "Science"
    },
    {
        "Id": "CPSC 502.03A",
        "Title": "Research Project in Computer Graphics",
        "Description": "This course is designed to provide students with the opportunity to engage in research in the field of computer graphics. Students will work on projects that explore the creation and manipulation of digital images and 3D models, and will gain experience with the latest graphics hardware and software.",
        "Instructor": "Jessica Nguyen",
        "Levels": 5,
        "Credits": 3,
        "Category": "Computer Science",
        "Semester": "Fall 2023",
        "Faculty": "Science"
    },
    {
        "Id": "CPSC 502.04A",
        "Title": "Research Project in Information Security",
        "Description": "This course is designed to provide students with the opportunity to engage in research in the field of information security. Students will work on projects that explore new and emerging threats to digital security, and will develop strategies and techniques for protecting sensitive information.",
        "Instructor": "Mike Johnson",
        "Levels": 5,
        "Credits": 3,
        "Category": "Computer Science",
        "Semester": "Fall 2023",
        "Faculty": "Science"
    },
    {
        "Id": "CPSC 502.05A",
        "Title": "Research Project in Scientific Computation",
        "Description": "This course is designed to provide students with the opportunity to engage in research in the field of scientific computation. Students will work on projects that apply computational methods to problems in science and engineering, and will develop algorithms and software tools to analyze and interpret scientific data.",
        "Instructor": "Jennifer Smith",
        "Levels": 5,
        "Credits": 3,
        "Category": "Computer Science",
        "Semester": "Fall 2023",
        "Faculty": "Science"
    },
    {
        "Id": "CPSC 502.06A",
        "Title": "Research Project in Software Engineering",
        "Description": "This course is designed to provide students with the opportunity to engage in research in the field of software engineering. Students will work on projects that develop and test new software systems and tools, and will gain experience with the latest software engineering methodologies and best practices.",
        "Instructor": "Timothy Lee",
        "Levels": 5,
        "Credits": 3,
        "Category": "Computer Science",
        "Semester": "Fall 2023",
        "Faculty": "Science"
    },
    {
        "Id": "CPSC 502.08A",
        "Title": "Research Project in Networks and Distributed Computing",
        "Description": "This course is focused on research in the areas of networks and distributed computing. Students will work in groups to design, implement, and evaluate novel systems for data communication and processing.",
        "Instructor": "Michael Lee",
        "Levels": 5,
        "Credits": 3,
        "Category": "Computer Science",
        "Semester": "Fall 2023",
        "Faculty": "Science"
    },
    {
        "Id": "CPSC 503.01",
        "Title": "Project in Computer Science",
        "Description": "In this course, students will work on a semester-long project related to computer science. They will choose a topic of their interest and develop a plan for implementing it. Throughout the course, they will learn about project management techniques and tools.",
        "Instructor": "David Smith",
        "Levels": 5,
        "Credits": 3,
        "Category": "Computer Science",
        "Semester": "Fall 2023",
        "Faculty": "Science"
    },
    {
        "Id": "CPSC 503.02",
        "Title": "Project in Theoretical Computer Science",
        "Description": "This course is focused on conducting research in theoretical computer science. Students will work in groups to develop and analyze algorithms and data structures for various computational problems. They will also learn about complexity theory and its applications.",
        "Instructor": "Jessica Chen",
        "Levels": 5,
        "Credits": 3,
        "Category": "Computer Science",
        "Semester": "Fall 2023",
        "Faculty": "Science"
    },
    {
        "Id": "CPSC 503.03",
        "Title": "Project in Computer Graphics",
        "Description": "In this course, students will learn about computer graphics and work on a project related to it. They will implement various rendering techniques and create visual effects using tools such as OpenGL and WebGL. They will also learn about 3D modeling and animation.",
        "Instructor": "Emily Brown",
        "Levels": 5,
        "Credits": 3,
        "Category": "Computer Science",
        "Semester": "Fall 2023",
        "Faculty": "Science"
    },
    {
        "Id": "CPSC 503.04",
        "Title": "Project in Information Security",
        "Description": "This course is focused on research in the area of information security. Students will work on a project related to security and privacy of data and systems. They will analyze various threats and vulnerabilities and design and implement techniques for securing them.",
        "Instructor": "John Wilson",
        "Levels": 5,
        "Credits": 3,
        "Category": "Computer Science",
        "Semester": "Fall 2023",
        "Faculty": "Science"
    },
    {
        "Id": "CPSC 503.05",
        "Title": "Project in Scientific Computation",
        "Description": "In this course, students will learn about scientific computing and work on a project related to it. They will implement numerical methods for solving various problems such as differential equations and optimization. They will also learn about parallel computing and its applications.",
        "Instructor": "Karen Johnson",
        "Levels": 5,
        "Credits": 3,
        "Category": "Computer Science",
        "Semester": "Fall 2023",
        "Faculty": "Science"
    },
    {
        "Id": "CPSC 503.06",
        "Title": "Project in Software Engineering",
        "Description": "In this project-based course, students will learn about software engineering practices and apply them to real-world problems. They will work in teams to design, develop, and test software systems, using industry-standard tools and techniques.",
        "Instructor": "John Smith",
        "Levels": 5,
        "Credits": 3,
        "Category": "Computer Science",
        "Semester": "Fall 2023",
        "Faculty": "Science"
    },
    {
        "Id": "CPSC 503.07",
        "Title": "Project in Human Computer Interaction",
        "Description": "In this project-based course, students will learn about human-computer interaction principles and apply them to design and evaluate interactive systems. They will work in teams to create prototypes and conduct user studies, using a variety of methods and tools.",
        "Instructor": "Samantha Lee",
        "Levels": 5,
        "Credits": 3,
        "Category": "Computer Science",
        "Semester": "Fall 2023",
        "Faculty": "Science"
    },
    {
        "Id": "CPSC 503.08",
        "Title": "Project in Networks and Distributed Computing",
        "Description": "In this project-based course, students will learn about networks and distributed computing systems and apply them to solve real-world problems. They will work in teams to design and implement network protocols and distributed algorithms, using a variety of programming languages and platforms.",
        "Instructor": "Michael Chen",
        "Levels": 5,
        "Credits": 3,
        "Category": "Computer Science",
        "Semester": "Fall 2023",
        "Faculty": "Science"
    },
    {
        "Id": "CPSC 522",
        "Title": "Introduction to Randomized Algorithms",
        "Description": "This course is an introduction to randomized algorithms, which are algorithms that use randomness to solve computational problems. Students will learn about the theory and practice of randomized algorithms, and apply them to a variety of problems in different domains.",
        "Instructor": "David Brown",
        "Levels": 5,
        "Credits": 3,
        "Category": "Computer Science",
        "Semester": "Fall 2023",
        "Faculty": "Science"
    },
    {
        "Id": "CPSC 525",
        "Title": "Principles of Computer Security",
        "Description": "This course is an introduction to computer security principles and techniques. Students will learn about common threats and vulnerabilities, as well as methods for protecting systems and data. They will also gain experience with tools and technologies used in the field.",
        "Instructor": "Sarah Williams",
        "Levels": 5,
        "Credits": 3,
        "Category": "Computer Science",
        "Semester": "Fall 2023",
        "Faculty": "Science"
    },
    {
        "Id": "CPSC 526",
        "Title": "Network Systems Security",
        "Description": "This course is an introduction to network security principles and techniques. Students will learn about common threats and vulnerabilities, as well as methods for securing network systems. They will also gain experience with tools and technologies used in the field.",
        "Instructor": "Mark Johnson",
        "Levels": 5,
        "Credits": 3,
        "Category": "Computer Science",
        "Semester": "Fall 2023",
        "Faculty": "Science"
    },
    {
        "Id": "CPSC 572",
        "Title": "Fundamentals of Social Network Analysis and Data Mining",
        "Description": "This course explores the concepts and techniques of social network analysis and data mining. Students will learn how to analyze complex networks and extract meaningful insights from large datasets. Topics covered include graph theory, clustering, classification, and association analysis.",
        "Instructor": "Michael Lee",
        "Levels": 5,
        "Credits": 3,
        "Category": "Computer Science",
        "Semester": "Fall 2023",
        "Faculty": "Science"
    },
    {
        "Id": "CPSC 581",
        "Title": "Human-Computer Interaction II",
        "Description": "This course focuses on advanced topics in human-computer interaction. Students will learn how to design and evaluate interactive systems, with an emphasis on usability and user experience. Topics covered include user-centered design, information visualization, and mobile computing.",
        "Instructor": "Sarah Kim",
        "Levels": 5,
        "Credits": 3,
        "Category": "Computer Science",
        "Semester": "Fall 2023",
        "Faculty": "Science"
    },
    {
        "Id": "CPSC 594A",
        "Title": "Software Engineering Project",
        "Description": "In this course, students will work on a software engineering project in a team environment. They will learn about project management, software design and development, and testing and maintenance. The course emphasizes agile development methodologies and effective communication.",
        "Instructor": "David Lee",
        "Levels": 5,
        "Credits": 3,
        "Category": "Computer Science",
        "Semester": "Fall 2023",
        "Faculty": "Science"
    },
    {
        "Id": "CPSC 599.82",
        "Title": "Special Topics in Computer Science (Retrogames)",
        "Description": "This course explores the history and development of retro video games. Students will learn about the hardware and software technologies used in classic games, and will develop their own retro-style games using modern programming tools. The course also covers topics such as game mechanics, level design, and user experience.",
        "Instructor": "James Park",
        "Levels": 5,
        "Credits": 3,
        "Category": "Computer Science",
        "Semester": "Fall 2023",
        "Faculty": "Science"
    },
    {
        "Id": "CPSC 601.10",
        "Title": "Special Topics in Computer Science (Comp Morphodynamics)",
        "Description": "This course explores the emerging field of computational morphodynamics, which combines computer science, biology, and physics. Students will learn about the simulation and analysis of biological growth and development, with applications in medicine, agriculture, and robotics. The course covers topics such as cellular automata, reaction-diffusion models, and morphogenetic gradients.",
        "Instructor": "Elizabeth Kim",
        "Levels": 6,
        "Credits": 3,
        "Category": "Computer Science",
        "Semester": "Fall 2023",
        "Faculty": "Science"
    },
    {
        "Id": "CPSC 601.36",
        "Title": "Special Topics in Computer Science (Wearable Applications)",
        "Description": "This course explores the design and development of wearable applications, which are computer programs that run on smart watches, fitness trackers, and other wearable devices. Students will learn about the unique challenges and opportunities of wearable computing, including user interface design, sensor integration, and battery management. The course covers topics such as gesture recognition, activity recognition, and health monitoring.",
        "Instructor": "John Lee",
        "Levels": 6,
        "Credits": 3,
        "Category": "Computer Science",
        "Semester": "Fall 2023",
        "Faculty": "Science"
    },
    {
        "Id": "DATA 201",
        "Title": "Thinking with Data",
        "Description": "This course provides an introduction to the concepts and methods of data science. Students will learn how to formulate questions, explore data, and communicate insights using visualizations and statistical models.",
        "Instructor": "Samantha Lee",
        "Levels": 2,
        "Credits": 3,
        "Category": "Data Science",
        "Semester": "Fall 2023",
        "Faculty": "Science"
    },
    {
        "Id": "DATA 311",
        "Title": "Data Processing and Storage",
        "Description": "This course covers the fundamentals of data processing and storage. Students will learn how to work with different data formats, databases, and cloud storage solutions.",
        "Instructor": "David Nguyen",
        "Levels": 3,
        "Credits": 3,
        "Category": "Data Science",
        "Semester": "Fall 2023",
        "Faculty": "Science"
    },
    {
        "Id": "DATA 601",
        "Title": "Working with Data and Visualization",
        "Description": "This course focuses on techniques for working with data and creating effective visualizations. Students will learn how to use tools like Python, R, and Tableau to explore and communicate data insights.",
        "Instructor": "Olivia Kim",
        "Levels": 6,
        "Credits": 3,
        "Category": "Data Science",
        "Semester": "Fall 2023",
        "Faculty": "Science"
    },
    {
        "Id": "DATA 604",
        "Title": "Working with Data at Scale",
        "Description": "This course covers the challenges and opportunities of working with large-scale data sets. Students will learn how to use distributed systems like Hadoop and Spark to process and analyze big data.",
        "Instructor": "Brian Chen",
        "Levels": 6,
        "Credits": 3,
        "Category": "Data Science",
        "Semester": "Fall 2023",
        "Faculty": "Science"
    },
    {
        "Id": "ISEC 611",
        "Title": "Private Data Management",
        "Description": "This course introduces students to various methods for managing private data, including access control, privacy-preserving data publishing, data obfuscation, and cryptography. Students will also learn about relevant ethical and legal issues related to data privacy.",
        "Instructor": "Jessica Lee",
        "Levels": 6,
        "Credits": 3,
        "Category": "Information Security",
        "Semester": "Fall 2023",
        "Faculty": "Science"
    },
    {
        "Id": "ISEC 621",
        "Title": "Ethical Hacking Laboratory",
        "Description": "This course provides students with hands-on experience in ethical hacking, including penetration testing, vulnerability assessment, and social engineering. Students will also learn about legal and ethical issues related to ethical hacking.",
        "Instructor": "Mark Chen",
        "Levels": 6,
        "Credits": 3,
        "Category": "Information Security",
        "Semester": "Fall 2023",
        "Faculty": "Science"
    },
    {
        "Id": "ISEC 641",
        "Title": "Governance and Risk Management",
        "Description": "This course covers various aspects of governance and risk management in the context of information security. Students will learn about risk assessment and management, security policies and procedures, regulatory compliance, and incident response. They will also gain an understanding of how to implement security measures in a way that aligns with business objectives.",
        "Instructor": "Alex Kim",
        "Levels": 6,
        "Credits": 3,
        "Category": "Information Security",
        "Semester": "Fall 2023",
        "Faculty": "Science"
    },
    {
        "Id": "ISEC 643",
        "Title": "Policies, Standards and Programs",
        "Description": "This course provides students with an overview of policies, standards, and programs related to information security. Students will learn about various industry standards, such as ISO 27001 and NIST, and best practices for implementing them. They will also gain experience in developing security policies and programs that are tailored to organizational needs.",
        "Instructor": "Rachel Park",
        "Levels": 6,
        "Credits": 3,
        "Category": "Information Security",
        "Semester": "Fall 2023",
        "Faculty": "Science"
    },
    {
        "Id": "SENG 300",
        "Title": "Introduction to Software Engineering",
        "Description": "This course introduces students to the fundamental principles and practices of software engineering. Topics covered include requirements analysis, software design, implementation, testing, and maintenance. Students will also learn about software development methodologies and tools.",
        "Instructor": "John Smith",
        "Levels": 3,
        "Credits": 3,
        "Category": "Software Engineering",
        "Semester": "Fall 2023",
        "Faculty": "Science"
    },
    {
        "Id": "SENG 511",
        "Title": "Software Project Management",
        "Description": "This course covers the management of software projects, including project planning, scheduling, budgeting, risk management, and quality assurance. Students will also learn about project management tools and techniques.",
        "Instructor": "Sarah Brown",
        "Levels": 5,
        "Credits": 3,
        "Category": "Software Engineering",
        "Semester": "Fall 2023",
        "Faculty": "Science"
    },
    {
        "Id": "SENG 513",
        "Title": "Web-Based Systems",
        "Description": "This course covers the principles and technologies used in the development of web-based systems. Topics covered include web development frameworks, client-server architecture, web security, and web services. Students will also gain practical experience with web development tools.",
        "Instructor": "David Lee",
        "Levels": 5,
        "Credits": 3,
        "Category": "Software Engineering",
        "Semester": "Fall 2023",
        "Faculty": "Science"
    },
    {
        "Id": "SENG 523",
        "Title": "Formal Methods",
        "Description": "This course covers the formal methods used in software development, including mathematical models and techniques for software specification, verification, and validation. Students will also gain practical experience with formal methods tools.",
        "Instructor": "Jennifer Kim",
        "Levels": 5,
        "Credits": 3,
        "Category": "Software Engineering",
        "Semester": "Fall 2023",
        "Faculty": "Science"
    },
    {
        "Id": "SENG 541",
        "Title": "Fundamentals of Software Evolution and Reuse",
        "Description": "This course covers the fundamental principles and techniques of software evolution and reuse. Topics covered include software maintenance, evolution, and refactoring, as well as software reuse models and techniques. Students will also gain practical experience with software evolution and reuse tools.",
        "Instructor": "Michael Chen",
        "Levels": 5,
        "Credits": 3,
        "Category": "Software Engineering",
        "Semester": "Fall 2023",
        "Faculty": "Science"
    },
    {
        "Id": "SENG 550",
        "Title": "Scalable Data Analytics",
        "Description": "This course covers the principles and techniques of scalable data analytics for software engineering. Topics covered include big data analytics, distributed data processing, and machine learning. Students will also gain practical experience with data analytics tools.",
        "Instructor": "Amy Lee",
        "Levels": 5,
        "Credits": 3,
        "Category": "Software Engineering",
        "Semester": "Fall 2023",
        "Faculty": "Science"
    },
    {
        "Id": "SENG 641",
        "Title": "Software Evolution and Reuse",
        "Description": "This course is an advanced course on software evolution and reuse. Topics covered include software architecture, design patterns, and software product lines. Students will also gain practical experience with software evolution and reuse tools.",
        "Instructor": "Robert Johnson",
        "Levels": 6,
        "Credits": 3,
        "Category": "Software Engineering",
        "Semester": "Fall 2023",
        "Faculty": "Science"
    },
    {
        "Id": "SENG 300",
        "Title": "Introduction to Software Engineering",
        "Description": "This course introduces the fundamental concepts of software engineering. Students will learn about the software development process, software development methodologies, and software development tools. They will also gain experience working in teams to develop software projects.",
        "Instructor": "Adam Smith",
        "Levels": 3,
        "Credits": 3,
        "Category": "Software Engineering",
        "Semester": "Winter 2023",
    "Faculty": "Science"
    },
    {
        "Id": "SENG 401",
        "Title": "Software Architecture",
        "Description": "This course covers the principles and practices of software architecture. Students will learn about the different architectural styles and patterns, as well as techniques for designing and evaluating software architectures. They will also gain experience using software architecture tools.",
        "Instructor": "Sarah Johnson",
        "Levels": 4,
        "Credits": 3,
        "Category": "Software Engineering",
        "Semester": "Winter 2023",
        "Faculty": "Science"
    },
    {
        "Id": "SENG 438",
        "Title": "Software Testing, Reliability, and Quality",
        "Description": "This course covers the principles and practices of software testing, reliability, and quality. Students will learn about different testing techniques, as well as techniques for ensuring software reliability and quality. They will also gain experience using testing and quality assurance tools.",
        "Instructor": "Michael Lee",
        "Levels": 4,
        "Credits": 3,
        "Category": "Software Engineering",
        "Semester": "Winter 2023",
        "Faculty": "Science"
    },
    {
        "Id": "SENG 471",
        "Title": "Software Requirements Engineering",
        "Description": "This course covers the principles and practices of software requirements engineering. Students will learn about techniques for eliciting, analyzing, specifying, validating, and managing software requirements. They will also gain experience using software requirements tools.",
        "Instructor": "Karen Brown",
        "Levels": 4,
        "Credits": 3,
        "Category": "Software Engineering",
        "Semester": "Winter 2023",
        "Faculty": "Science"
    },
    {
        "Id": "SENG 533",
        "Title": "Software Performance Evaluation",
        "Description": "This course covers the principles and practices of software performance evaluation. Students will learn about techniques for modeling, simulating, measuring, analyzing, and improving software performance. They will also gain experience using performance evaluation tools.",
        "Instructor": "David Chen",
        "Levels": 5,
        "Credits": 3,
        "Category": "Software Engineering",
        "Semester": "Winter 2023",
        "Faculty": "Science"
    },
    {
        "Id": "SENG 608",
        "Title": "Analytical Software Project Management",
        "Description": "This course covers the principles and practices of software project management. Students will learn about techniques for planning, monitoring, controlling, and closing software projects. They will also gain experience using project management tools.",
        "Instructor": "Lisa Taylor",
        "Levels": 6,
        "Credits": 3,
        "Category": "Software Engineering",
        "Semester": "Winter 2023",
        "Faculty": "Science"
    },
    {
        "Id": "SENG 637",
        "Title": "Dependability and Reliability of Software Systems",
        "Description": "This course covers the principles and practices of dependability and reliability of software systems. Students will learn about techniques for designing, implementing, testing, and maintaining dependable and reliable software systems. They will also gain experience using software dependability and reliability tools.",
        "Instructor": "John Davis",
        "Levels": 6,
        "Credits": 3,
        "Category": "Software Engineering",
        "Semester": "Winter 2023",
        "Faculty": "Science"
    },
    {
        "Id": "DATA 201",
        "Title": "Thinking with Data",
        "Description": "This course introduces students to the basics of data analysis and interpretation. Students will learn how to collect and manage data, as well as how to use statistical techniques to draw conclusions from data.",
        "Instructor": "John Smith",
        "Levels": 2,
        "Credits": 3,
        "Category": "Data Science",
        "Semester": "Winter 2023",
        "Faculty": "Science"
    },
    {
        "Id": "DATA 211",
        "Title": "Programming with Data",
        "Description": "This course teaches students how to use programming languages to analyze and manipulate data. Students will learn how to write code to collect, clean, and transform data, as well as how to visualize and communicate their results.",
        "Instructor": "Jane Doe",
        "Levels": 2,
        "Credits": 3,
        "Category": "Data Science",
        "Semester": "Winter 2023",
        "Faculty": "Science"
    },
    {
        "Id": "DATA 601",
        "Title": "Working with Data and Visualization",
        "Description": "This course focuses on data visualization techniques and tools, as well as the practical considerations of working with data in a professional setting. Students will learn how to use visualization tools to communicate complex data to stakeholders.",
        "Instructor": "Robert Johnson",
        "Levels": 6,
        "Credits": 3,
        "Category": "Data Science",
        "Semester": "Winter 2023",
        "Faculty": "Science"
    },
    {
        "Id": "DATA 604",
        "Title": "Working with Data at Scale",
        "Description": "This course introduces students to the challenges and opportunities of working with large-scale data sets. Students will learn about distributed systems, cloud computing, and big data technologies.",
        "Instructor": "Karen Wilson",
        "Levels": 6,
        "Credits": 3,
        "Category": "Data Science",
        "Semester": "Winter 2023",
        "Faculty": "Science"
    },
    {
        "Id": "DATA 605",
        "Title": "Actionable Visualization and Analytics",
        "Description": "This course teaches students how to create actionable insights from data using advanced visualization and analytics techniques. Students will learn how to identify patterns and trends in data, and how to use these insights to inform decision-making.",
        "Instructor": "David Lee",
        "Levels": 6,
        "Credits": 3,
        "Category": "Data Science",
        "Semester": "Winter 2023",
        "Faculty": "Science"
    },
    {
        "Id": "DATA 608",
        "Title": "Developing Big Data Applications",
        "Description": "This course teaches students how to design and build applications that work with large-scale data sets. Students will learn how to use distributed computing frameworks and big data technologies to build scalable applications.",
        "Instructor": "Sarah Jackson",
        "Levels": 6,
        "Credits": 3,
        "Category": "Data Science",
        "Semester": "Winter 2023",
        "Faculty": "Science"
    },
    {
        "Id": "CPSC 203",
        "Title": "Introduction to Problem Solving using Application Software",
        "Description": "This course provides an introduction to programming and problem-solving using application software. Topics covered include algorithms, data types, control structures, functions, and file input/output.",
        "Instructor": "John Smith",
        "Levels": 2,
        "Credits": 3,
        "Category": "Computer Science",
        "Semester": "Winter 2023",
        "Faculty": "Science"
      },
      {
        "Id": "CPSC 217",
        "Title": "Introduction to Computer Science for Multidisciplinary Studies I",
        "Description": "This course provides an introduction to computer science for students from various disciplines. Topics covered include programming, algorithms, data structures, and problem-solving techniques.",
        "Instructor": "Sarah Johnson",
        "Levels": 2,
        "Credits": 3,
        "Category": "Computer Science",
        "Semester": "Winter 2023",
        "Faculty": "Science"
      },
      {
        "Id": "CPSC 219",
        "Title": "Introduction to Computer Science for Multidisciplinary Studies II",
        "Description": "This course is a continuation of CPSC 217 and provides an introduction to more advanced topics in computer science, including recursion, sorting and searching, and object-oriented programming.",
        "Instructor": "Michael Lee",
        "Levels": 2,
        "Credits": 3,
        "Category": "Computer Science",
        "Semester": "Winter 2023",
        "Faculty": "Science"
      },
      {
        "Id": "CPSC 233",
        "Title": "Introduction to Computer Science for Computer Science Majors II",
        "Description": "This course is a continuation of CPSC 231 and provides an introduction to more advanced topics in computer science, including recursion, sorting and searching, and object-oriented programming.",
        "Instructor": "Karen Brown",
        "Levels": 2,
        "Credits": 3,
        "Category": "Computer Science",
        "Semester": "Winter 2023",
        "Faculty": "Science"
      },
      {
        "Id": "CPSC 251",
        "Title": "Theoretical Foundations of Computer Science I",
        "Description": "This course provides an introduction to the theoretical foundations of computer science, including logic, set theory, and formal languages.",
        "Instructor": "David Lee",
        "Levels": 2,
        "Credits": 3,
        "Category": "Computer Science",
        "Semester": "Winter 2023",
        "Faculty": "Science"
      },
      {
        "Id": "CPSC 319",
        "Title": "Data Structures, Algorithms, and Their Applications",
        "Description": "This course covers data structures and algorithms and their applications in computer science. Topics covered include arrays, linked lists, stacks, queues, trees, graphs, sorting algorithms, and searching algorithms.",
        "Instructor": "Jennifer Chen",
        "Levels": 3,
        "Credits": 3,
        "Category": "Computer Science",
        "Semester": "Winter 2023",
        "Faculty": "Science"
      },
      {
        "Id": "CPSC 329",
        "Title": "Explorations in Information Security and Privacy",
        "Description": "This course provides an introduction to information security and privacy. Topics covered include cryptography, network security, and privacy issues.",
        "Instructor": "Jessica Wong",
        "Levels": 3,
        "Credits": 3,
        "Category": "Computer Science",
        "Semester": "Winter 2023",
        "Faculty": "Science"
      },
      {
        "Id": "CPSC 351",
        "Title": "Theoretical Foundations of Computer Science II",
        "Description": "This course builds upon the concepts covered in CPSC 251, focusing on the theoretical underpinnings of computer science, including automata theory, formal languages, and complexity theory.",
        "Instructor": "James Lee",
        "Levels": 3,
        "Credits": 3,
        "Category": "Computer Science",
        "Semester": "Winter 2023",
        "Faculty": "Science"
    },
    {
        "Id": "CPSC 355",
        "Title": "Computing Machinery I",
        "Description": "This course provides an introduction to the design and implementation of computer systems, including machine-level programming, processor architecture, and memory hierarchies.",
        "Instructor": "Karen Chen",
        "Levels": 3,
        "Credits": 3,
        "Category": "Computer Science",
        "Semester": "Winter 2023",
        "Faculty": "Science"
    },
    {
        "Id": "CPSC 359",
        "Title": "Computing Machinery II",
        "Description": "This course builds upon the concepts covered in CPSC 355, focusing on advanced topics in computer systems, including virtual memory, I/O systems, and network protocols.",
        "Instructor": "Michael Smith",
        "Levels": 3,
        "Credits": 3,
        "Category": "Computer Science",
        "Semester": "Winter 2023",
        "Faculty": "Science"
    },
    {
        "Id": "CPSC 393",
        "Title": "Metacognition in Self-directed Learning Methodologies",
        "Description": "This course explores the role of metacognition in learning, particularly in self-directed contexts. Students will develop strategies for setting goals, monitoring their own learning, and evaluating their progress.",
        "Instructor": "Emily Liu",
        "Levels": 3,
        "Credits": 3,
        "Category": "Computer Science",
        "Semester": "Winter 2023",
        "Faculty": "Science"
    },
    {
        "Id": "CPSC 399.5",
        "Title": "Special Topics in Computer Science (Reverse Engineering)",
        "Description": "This course explores the techniques and tools used in reverse engineering, including disassemblers, decompilers, and debugging tools. Students will apply these techniques to analyze and understand existing software.",
        "Instructor": "Thomas Nguyen",
        "Levels": 3,
        "Credits": 3,
        "Category": "Computer Science",
        "Semester": "Winter 2023",
        "Faculty": "Science"
    },
    {
        "Id": "CPSC 409",
        "Title": "History Of Computation",
        "Description": "This course surveys the history of computing, from ancient times to the present day. Students will explore the development of key concepts and technologies, as well as the social and cultural factors that shaped their evolution.",
        "Instructor": "Laura Kim",
        "Levels": 4,
        "Credits": 3,
        "Category": "Computer Science",
        "Semester": "Winter 2023",
        "Faculty": "Science"
    },
    {
        "Id": "CPSC 413",
        "Title": "Design and Analysis of Algorithms I",
        "Description": "This course covers the design and analysis of algorithms. Topics include complexity analysis, dynamic programming, greedy algorithms, graph algorithms, and more.",
        "Instructor": "Alice Smith",
        "Levels": 4,
        "Credits": 3,
        "Category": "Computer Science",
        "Semester": "Winter 2023",
        "Faculty": "Science"
    },
    {
        "Id": "CPSC 418",
        "Title": "Introduction to Cryptography",
        "Description": "This course provides an introduction to cryptography. Topics include symmetric and asymmetric encryption, hash functions, digital signatures, and more.",
        "Instructor": "Bob Johnson",
        "Levels": 4,
        "Credits": 3,
        "Category": "Computer Science",
        "Semester": "Winter 2023",
        "Faculty": "Science"
    },
    {
        "Id": "CPSC 441",
        "Title": "Computer Networks",
        "Description": "This course covers computer networks and their protocols. Topics include the OSI model, TCP/IP, network architecture, routing algorithms, and more.",
        "Instructor": "Charlie Brown",
        "Levels": 4,
        "Credits": 3,
        "Category": "Computer Science",
        "Semester": "Winter 2023",
        "Faculty": "Science"
    },
    {
        "Id": "CPSC 449",
        "Title": "Programming Paradigms",
        "Description": "This course covers various programming paradigms, including procedural, object-oriented, and functional programming. Students will learn about language design and implementation.",
        "Instructor": "David Lee",
        "Levels": 4,
        "Credits": 3,
        "Category": "Computer Science",
        "Semester": "Winter 2023",
        "Faculty": "Science"
    },
    {
        "Id": "CPSC 457",
        "Title": "Principles of Operating Systems",
        "Description": "This course covers the principles and design of operating systems. Topics include process management, memory management, file systems, and more.",
        "Instructor": "Emily Chen",
        "Levels": 4,
        "Credits": 3,
        "Category": "Computer Science",
        "Semester": "Winter 2023",
        "Faculty": "Science"
    },
    {
        "Id": "CPSC 471",
        "Title": "Data Base Management Systems",
        "Description": "This course covers database management systems. Topics include database design, query languages, indexing, transaction management, and more.",
        "Instructor": "Frank Zhang",
        "Levels": 4,
        "Credits": 3,
        "Category": "Computer Science",
        "Semester": "Winter 2023",
        "Faculty": "Science"
    },
    {
        "Id": "CPSC 481",
        "Title": "Human-Computer Interaction I",
        "Description": "This course covers human-computer interaction. Topics include user-centered design, prototyping, evaluation, and more.",
        "Instructor": "Grace Kim",
        "Levels": 4,
        "Credits": 3,
        "Category": "Computer Science",
        "Semester": "Winter 2023",
        "Faculty": "Science"
    },
    {
        "Id": "CPSC 491",
        "Title": "Techniques for Numerical Computation",
        "Description": "",
        "Instructor": "John Smith",
        "Levels": 4,
        "Credits": 3,
        "Category": "Computer Science",
        "Semester": "Winter 2023",
        "Faculty": "Science"
    },
    {
        "Id": "CPSC 502.01B",
        "Title": "Research Project in Computer Science",
        "Description": "",
        "Instructor": "Alice Johnson",
        "Levels": 5,
        "Credits": 3,
        "Category": "Computer Science",
        "Semester": "Winter 2023",
        "Faculty": "Science"
    },
    {
        "Id": "CPSC 502.02B",
        "Title": "Research Project in Theoretical Computer Science",
        "Description": "",
        "Instructor": "Bob Lee",
        "Levels": 5,
        "Credits": 3,
        "Category": "Computer Science",
        "Semester": "Winter 2023",
        "Faculty": "Science"
    },
    {
        "Id": "CPSC 502.03B",
        "Title": "Research Project in Computer Graphics",
        "Description": "",
        "Instructor": "Catherine Brown",
        "Levels": 5,
        "Credits": 3,
        "Category": "Computer Science",
        "Semester": "Winter 2023",
        "Faculty": "Science"
    },
    {
        "Id": "CPSC 502.04B",
        "Title": "Research Project in Information Security",
        "Description": "",
        "Instructor": "David Wilson",
        "Levels": 5,
        "Credits": 3,
        "Category": "Computer Science",
        "Semester": "Winter 2023",
        "Faculty": "Science"
    },
    {
        "Id": "CPSC 502.05B",
        "Title": "Research Project in Scientific Computation",
        "Description": "",
        "Instructor": "Emily Chen",
        "Levels": 5,
        "Credits": 3,
        "Category": "Computer Science",
        "Semester": "Winter 2023",
        "Faculty": "Science"
    },
    {
        "Id": "CPSC 502.08B",
        "Title": "Research Project in Networks and Distributed Computing",
        "Description": "",
        "Instructor": "Frank Davis",
        "Levels": 5,
        "Credits": 3,
        "Category": "Computer Science",
        "Semester": "Winter 2023",
        "Faculty": "Science"
    },
    {
        "Id": "CPSC 503.01",
        "Title": "Project in Computer Science",
        "Description": "",
        "Instructor": "Grace Jones",
        "Levels": 5,
        "Credits": 3,
        "Category": "Computer Science",
        "Semester": "Winter 2023",
        "Faculty": "Science"
    },
    {
        "Id": "CPSC 503.05",
        "Title": "Project in Scientific Computation",
        "Description": "",
        "Instructor": "Henry Kim",
        "Levels": 5,
        "Credits": 3,
        "Category": "Computer Science",
        "Semester": "Winter 2023",
        "Faculty": "Science"
    }
]